Repository: manhquynh-github/MBTI
Catalog: MBTI.Resources/Properties/Content.*.resx
Languages: vi

# SAbout
source: About
vi: Thông tin

# SBack
source: Back
vi: Trở về

# SBackToResults
source: Back to results
vi: Trở về kết quả

# SChangeLanguage
source: Change language
vi: Đổi ngôn ngữ

# SChoosePersonalityType
source: Choose another personality type
vi: Chọn một tính cách khác

# SContinue
source: Continue
vi: Tiếp tục

# SExit
source: Exit
vi: Kết thúc

# SExtrovert
source: Extrovert
vi: Hướng ngoại

# SFeeling
source: Feeling
vi: Tình cảm

# SGoToGitHubSource
source: Go to source on GitHub
vi: Xem source ở GitHub

# SHomeTooltip
source: Go back to home screen
vi: Trở về màn hình chính

# SInput
source: Your input:
vi: Nhập:

# SInstruction1
source: Click on the sentence that best describes you
vi: Nhấn vào câu mô tả rõ nét về bạn nhất

# SInstruction2
source: Be true to yourself
vi: Hãy thành thật với chính mình

# SInstruction3
source: You have completed the quiz
vi: Bạn đã hoàn thành trắc nghiệm

# SInstruction4
source: Your personality type is
vi: Tính cách đại diện của bạn là

# SIntrovert
source: Introvert
vi: Hướng nội

# SIntuition
source: Intuition
vi: Trực giác

# SJudging
source: Judging
vi: Kế hoạch

# SMBTIDescription
source: The Myers–Briggs Type Indicator (MBTI) is a pseudoscientific introspective self-report questionnaire indicating differing psychological preferences in how people perceive the world and make decisions.
vi: Chỉ số phân loại Myers-Briggs (Myers-Briggs Type Indication), thường được viết ngắn gọn là MBTI, là một phương pháp sử dụng các câu hỏi trắc nghiệm tâm lý để tìm hiểu tâm lý, tính cách cũng như cách con người nhận thức thế giới xung quanh, đưa ra quyết định cho một vấn đề...

# SPerceptive
source: Perceptive
vi: Linh hoạt

# SPersonality
source: Personality
vi: Tính cách

# SQuestion
source: Question
vi: Câu

# SQuiz
source: take a quiz
vi: trắc nghiệm

# SReadMoreAtWikipedia
source: Read more at Wikipedia in a browser
vi: Xem thêm ở Wikipedia

# SSelect1
source: Select (1)
vi: Chọn (1)

# SSelect2
source: Select (2)
vi: Chọn (2)

# SSensing
source: Sensing
vi: Thực tế

# SStudy
source: learn
vi: tìm hiểu

# SSubtitle
source: Understands & Helps you choose suitable jobs
vi: Hiểu bạn & Chọn nghề nghiệp thích hợp với bạn

# SSuggestedJobs
source: Suggested jobs
vi: Nghề nghiệp thích hợp

# SThinking
source: Thinking
vi: Lý trí

# STitle
source: MBTI
vi: CHỈ SỐ MBTI

# STitleNormal
source: MBTI
vi: Chỉ số MBTI

# STryAgain
source: Please try again
vi: Vui lòng thử lại
