{
  "ISTJ": {
    "Descriptions": [
      "Serious, quiet, making achievements through patience, precision, and determination",
      "Has practical, logical thinking, disciplined and trustworthy, always wants everything to be in order",
      "Can self-motivate to do the job without relaxing",
      "Prefers details and stability",
      "Responsible, dislikes novels and superficial things",
      "Respects traditions and sincerity"
    ],
    "SuggestedJobs": [
      "Secretary, Clerk, Business Person",
      "Meteorologist",
      "Database Administrator",
      "Healthcare Professionalist",
      "Accountant",
      "Real Estate Agent",
      "Construction Engineer, Construction Supervisor",
      "Detective",
      "Agricultural Engineer",
      "Managing Director"
    ]
  },
  "ISTP": {
    "Descriptions": [
      "Patient, quiet, discreet",
      "Objective and not sentimental",
      "Observes and analyzes life deeply, handles situations scientifically, usually analyzes problems using lots of statistical data and practical experience",
      "Focuses on what matters, likes simple but effective solutions, is very creative when addressing urgent problems"
    ],
    "SuggestedJobs": [
      "Programmer",
      "Pilot",
      "Hotline Assistant",
      "Police Officer",
      "Software Developer",
      "Information Service Manager",
      "Detective",
      "Pharmacist"
    ]
  },
  "ISFJ": {
    "Descriptions": [
      "Calm, sentimental, responsible, caring and generous to others",
      "Really cares about what others think of ownself",
      "Devoted, diligent to do the job in time",
      "Wants a stable life, lives practically, likes simple, easy but effective solutions",
      "Respects the rules, traditions, and wants everyone to do the same",
      "Always tries to balance between work and family"
    ],
    "SuggestedJobs": [
      "Nutritionist",
      "Librarian, Archivist",
      "Interior Designer",
      "Credit Officer",
      "Customer Service",
      "Accountant",
      "Counsellor",
      "Teacher"
    ]
  },
  "ISFP": {
    "Descriptions": [
      "Calm, discreet, sensitive, considerate and kind",
      "Very sensitive and can easily get hurt",
      "Usually avoids controversy, does not assume opinions or values on others",
      "In work, usually solves problems by using own experience in the simplest and most practical way",
      "Likes details, precision",
      "Does not want to be limited to the same patterns, schedules, can easily adapt to change"
    ],
    "SuggestedJobs": [
      "Doctor",
      "Interior Designer",
      "Customer Service",
      "Fashion Designer",
      "Surveyor",
      "Nurse",
      "Dentist",
      "Travel Agent, Tour Guide",
      "Medical Assistant"
    ]
  },
  "INTJ": {
    "Descriptions": [
      "Has lots of creative ideas, always finds new ways to solve problems",
      "Can have an overall view of the issue, is visionary, can make plans and is determined to achieve the set goals",
      "Usually sets high expectations for ownself and other people",
      "Usually explains everything scientifically, decides everything objectively",
      "Very discreet, thinks deeply, lives independently and orderly"
    ],
    "SuggestedJobs": [
      "Design Engineer",
      "Network Integration Specialist",
      "Software Developer",
      "Neurologist",
      "Cardiologist",
      "Writer",
      "Inventor",
      "Finance Director",
      "Web Administrator",
      "Architect"
    ]
  },
  "INTP": {
    "Descriptions": [
      "Quiet, discreet, always excels in competitions, especially in scientific and theoretical subjects",
      "Has high creativity, is usually interested in new ideas instead of parties or chatting",
      "Has strong personality, therefore likes a job that requires it",
      "Has logical, broad, and visionary thinking, but does not like to be limited to the same patterns, is flexible and can easily adapt to change"
    ],
    "SuggestedJobs": [
      "Software designer",
      "Risky Capitalist",
      "Finance Analyst",
      "Economist",
      "Professor: Philosophy, Economy",
      "Musician",
      "Web Designer",
      "Detective",
      "Strategist",
      "Neurologist",
      "Pharmaceutical Researcher"
    ]
  },
  "INFJ": {
    "Descriptions": [
      "A bit quiet, keeps to ownself and usually thinks about life, worldview. May appear cold and care about nothing but \"silence\" from the outside. But actually tends to observe, keep an eye on every little detail that happens. Relationships are built in a \"slow and steady\" manner. A little mystery that lives within makes everyone want to explore and figure out. This creates \"attractiveness\".",
      "Has creativity and has the ability to work independently. Always thinks clearly before doing anything. Always has great passionate in whatever is being done.",
      "Makes plans and is determined to achieve goals. Has the ability to make anything happen through clear vision and to best serve humanity."
    ],
    "SuggestedJobs": [
      "Teacher",
      "Architect",
      "Manager, Head of Department, Coach",
      "Speaker, Linguist",
      "Job Counsellor",
      "Environmentalist",
      "Specialist",
      "Editor, Art Director",
      "Writer",
      "Planner"
    ]
  },
  "INFP": {
    "Descriptions": [
      "Perfectionist, has a great passion for creativity, never limits ownself to available patterns, \"traditional\" methods but instead always thinks of new solutions to apply long-term",
      "Does not really care about making plans that are too detailed but instead improvise",
      "Towards friends or colleagues, always proves to be a trustworthy, caring, and helpful person",
      "Sensitive, and can easily get hurt for minor reasons"
    ],
    "SuggestedJobs": [
      "Psychologist",
      "Human Resources Manager",
      "Specialist",
      "Researcher",
      "Interpreter, Translator",
      "Staff Coach and Trainer",
      "Professor: Humanities",
      "Social Worker",
      "Librarian",
      "Fashion Designer",
      "Editorial Director/Art Director (website)"
    ]
  },
  "ESTJ": {
    "Descriptions": [
      "Has the qualities of a leader, has the ability to arrange work perfectly, likes to take responsibilities",
      "Is an ideal person for work, always analyzes and applies anything that is logical to work, decides quickly, always tries to do the job efficiently, so as to quickly get to the next work",
      "Is responsible and expects everyone to be the same",
      "Has the ability to organize, operate, likes to participate in community work",
      "Has a tendency to be straightforward, not hesitant to criticize when necessary"
    ],
    "SuggestedJobs": [
      "Business Director",
      "Army Officer",
      "Chief Information Officer",
      "Sport Equipment Salesperson",
      "Real Estate Agent",
      "Budget Planner",
      "Administration: Healthcare",
      "Pharmacist",
      "Credit Advisor",
      "Insurance Agent",
      "Teacher: Commerce, Technology, Engineering",
      "Property Manager"
    ]
  },
  "ESTP": {
    "Descriptions": [
      "Energetic, strong, practical",
      "Usually finds simple, easily applicable solutions to deal with work",
      "Prefers taking actions to thinking of and finding out new theories",
      "Likes to meet up, communicate with people, sociable, sincere, easy-going but sometimes being \"criticized\" as indelicate"
    ],
    "SuggestedJobs": [
      "Healthcare Worker",
      "Stockbroker",
      "Physiologist",
      "Insurance Agent",
      "Engineer",
      "Entrepreneur",
      "Marine Researcher",
      "Detective",
      "Travel Agent",
      "Professional Athlete, Coach",
      "Contractor",
      "Game Developer",
      "Real Estate Agent"
    ]
  },
  "ESFJ": {
    "Descriptions": [
      "Kind, devoted, cooperative",
      "Cares and helps others in every-day life",
      "Loves harmonious living environment, works hard to make it happen",
      "Likes to work with those who get things done and on time",
      "Very good at making use of gained experience in work and life",
      "Worries the most about things that can directly and clearly affect human life, not interested in abstract theories"
    ],
    "SuggestedJobs": [
      "Real Estate Agent",
      "Fitness Coach",
      "Veterinarian",
      "Teacher",
      "Retailer",
      "Credit Advisor",
      "Nurse",
      "Home Healthcare Worker",
      "Collector",
      "Athletic Coach",
      "Food Service, Motel",
      "Travel Agent"
    ]
  },
  "ESFP": {
    "Descriptions": [
      "Likes to socialize, make new friends, and expand relationships",
      "Cares about the others and do the best to prove it with real actions",
      "Likes to indulge and experience life rather than sit back and make judges",
      "Easy-going, humorous, sometimes impulsive. Always know whatu0027s up and join in happily and enthusiastically, likes sports or social work",
      "Likes to gain real-life experience rather than learning from theories"
    ],
    "SuggestedJobs": [
      "Elementary School Teacher",
      "Dental Assistant",
      "Home Healthcare Worker",
      "Public Relations, Human Resources Communication",
      "Radiologist",
      "Doctor",
      "Travel Agent, Tour Guide",
      "Founder",
      "Actor/Actress",
      "Veterinarian",
      "Event Organizer",
      "Marine Researcher",
      "Business: Sport Equipment"
    ]
  },
  "ENTJ": {
    "Descriptions": [
      "Has all the qualities to become a talented leader",
      "Quickly identifies illogical, inefficient processes, policies",
      "Knows how to run a system, solve the problems of a organization. Loves long-term plans",
      "Knows how to encourage, motivate the others to do the job and complete the goals",
      "Sincere, friendly, but also straightforward and sometimes hurts other people"
    ],
    "SuggestedJobs": [
      "Chief Executive Officer",
      "Network Administrator",
      "Management Consultant",
      "Business Person",
      "Finance Executive",
      "Budget Planner",
      "Real Estate Agent",
      "Marketing Staff",
      "Intellectual Property Manager",
      "Investment Planner/Consultant",
      "Financial Analyst",
      "Chemical Engineer",
      "Education Consultant",
      "Judge"
    ]
  },
  "ENTP": {
    "Descriptions": [
      "Agile, talented, knows how to inspire, quick-witted and intuitive",
      "Likes to address new and challenging issues. Good at having propspects and analyzing from strategic perspectives",
      "Can read other peopleu0027s idea",
      "Dislikes procedures, rarely works the same way for a long time",
      "Always has passions and are always in a state of non-stop trying to achieve the goals"
    ],
    "SuggestedJobs": [
      "Entrepreneur, Contractor",
      "Bank Investor",
      "Risky Investor",
      "Marketing Manager/Consultant",
      "Copywriter",
      "Broadcaster (Radio/TV), Master of Ceremonies (MC), Host/Hostess",
      "Real Estate Agent",
      "Actor/Actress",
      "Strategic Planner",
      "Rector",
      "Phychological Counsellor, Staff Motivator",
      "Marketing Assistant",
      "Advertising Director/Creative Director"
    ]
  },
  "ENFJ": {
    "Descriptions": [
      "Enthusiastic, responsible, and trustworthy",
      "Has the ability to communicate, is easily empathetic, understands other peopleu0027s needs and motivates them. Can easily recognize everyoneu0027s abilities and helps them develop those",
      "Is a catalyst for individuals and groups to develop",
      "Good with people, helps everyone find comfort and creates the groupu0027s spiritual strength",
      "Has creativity, does not limit ownself to \"ordinary\" thoughts"
    ],
    "SuggestedJobs": [
      "Event Organizer",
      "Consultant",
      "Psychologist",
      "Social Worker, Lawyer",
      "Teacher",
      "Sales Agent",
      "Human Resources",
      "Director",
      "Politician, Diplomat",
      "Writer"
    ]
  },
  "ENFP": {
    "Descriptions": [
      "Likes novelty: new ideas, new activities, new people,...",
      "Good at communication, warm, friendly and cares about the others",
      "Always optimistic and looks into the future. This is the kind of person who is \"energetic\", strong, enthusiastic, and has a life without constraints, can easily adapt to change",
      "Has the ability to connect the dots and make observations, provide solutions to any problems"
    ],
    "SuggestedJobs": [
      "Customer Manager",
      "Job Counsellor",
      "Management Consultant",
      "Software Developer",
      "Actor/Actress",
      "Graphic Designer",
      "Art Director",
      "Copywriter",
      "Coach, Trainer",
      "Psychologist",
      "Inventor",
      "Human Resources",
      "Child Rights Advisor"
    ]
  }
}